# -*- coding: utf-8 -*-

import random
import datetime
import time
# 住院
dataCount = 10000000   #10M.
codeRange = range(ord('a'), ord('z'))
alphaRange = [chr(x) for x in codeRange]
alphaMax = len(alphaRange)
daysMax = 370
theDay = datetime.date(2017, 1, 1)

people_list = [
    {'record_id': '000001', 'name': '宋江', 'id_card': '330101199001010001'},
    {'record_id': '000002', 'name': '卢俊义', 'id_card': '330101199001010002'},
    {'record_id': '000003', 'name': '吴用', 'id_card': '330101199001010003'},
    {'record_id': '000004', 'name': '公孙胜', 'id_card': '330101199001010004'},
    {'record_id': '000005', 'name': '关胜', 'id_card': '330101199001010005'},
    {'record_id': '000006', 'name': '林冲', 'id_card': '330101199001010006'},
    {'record_id': '000007', 'name': '秦明', 'id_card': '330101199001010007'},
    {'record_id': '000008', 'name': '呼延灼', 'id_card': '330101199001010008'},
    {'record_id': '000009', 'name': '花荣', 'id_card': '330101199001010009'},
    {'record_id': '000010', 'name': '柴进', 'id_card': '330101199001010010'},
    {'record_id': '000011', 'name': '李应', 'id_card': '330101199001010011'},
    {'record_id': '000012', 'name': '朱仝', 'id_card': '330101199001010012'},
    {'record_id': '000013', 'name': '鲁智深', 'id_card': '330101199001010013'},
    {'record_id': '000014', 'name': '武松', 'id_card': '330101199001010014'},
    {'record_id': '000015', 'name': '董平', 'id_card': '330101199001010015'},
    {'record_id': '000016', 'name': '张清', 'id_card': '330101199001010016'},
    {'record_id': '000017', 'name': '杨志', 'id_card': '330101199001010017'},
    {'record_id': '000018', 'name': '徐宁', 'id_card': '330101199001010018'},
    {'record_id': '000019', 'name': '索超', 'id_card': '330101199001010019'},
    {'record_id': '000020', 'name': '戴宗', 'id_card': '330101199001010020'},
]

name_list = ['贾演', '贾源', '史太君', '史鼎', '王子腾', '王子胜', '薛蟠', '薛蝌', '林黛玉', '妙玉', '袭人', '媚人', '晴雯',
             '绮霰', '檀云', '秋纹', '碧浪', '茜雪', '春燕', '赵亦华']

# 科室编码和名称
dept_list = [
['A01', '预防保健科'],
['A02', '全科医疗科'],
['A03', '内科'],
['A03.01', '呼吸内科专业'],
['A03.02', '消化内科专业'],
['A03.03', '神经内科专业'],
['A03.04', '心血管内科专业'],
['A03.05', '血液内科专业'],
['A03.06', '肾病学专业'],
['A03.07', '内分泌专业'],
['A03.08', '免疫学专业'],
['A03.09', '变态反应专业'],
['A03.10', '老年病专业'],
['A03.99', '其他'],
['A04', '外科'],
['A04.01', '普通外科专业'],
['A04.01.01', '肝脏移植项目'],
['A04.01.02', '胰腺移植项目'],
['A04.01.03', '小肠移植项目'],
['A04.02', '神经外科专业'],
['A04.03', '骨科专业'],
['A04.04', '泌尿外科专业'],
['A04.04.01', '肾脏移植项目'],
['A04.05', '胸外科专业'],
['A04.05.01', '肺脏移植项目'],
['A04.06', '心脏大血管外科专业'],
['A04.06.01', '心脏移植项目']]

# 机构编码和名称
hospital_list = [['01', '顶级医院'],
                 ['0101', '二级医院A'],
                 ['010101', '高青县中医院'],
                 ['010102', '高青县慈善医院'],
                 ['0102', '二级医院B'],
                 ['010201', '高青丽康医院'],
                 ['010202', '淄博市中心医院(高青院区)'],
                 ['0103', '二级医院C'],
                 ['010301', '高青县妇幼保健院'],
                 ['010302', '高青县花沟中心卫生院'],
                 ['010303', '高青县中医医院开发区卫生所'],
                 ['010304', '高青县城区办事处青苑社区卫生服务站'],
                 ['0104', '二级医院D'],
                 ['010401', '董家骨科'],
                 ['010402', '高苑社区卫生服务站'],
                 ['010403', '滨州沪滨爱尔眼科医院'],
                 ['010404', '淄博市高青县残疾人康复医院'],
                 ['0105', '二级医院E'],
                 ['010501', '高青东方老年医院'],
                 ['010502', '中医药针灸疑难病专科医院'],
                 ['0106', '二级医院F'],
                 ['010601', '滨州医学院附属医院协作医院'],
                 ['010602', '高青瑞佳口腔医院'],
                 ['010603', '济南明水眼科医院接送点'],
                 ['010604', '高青瑞佳口腔医院']]


steer_person_desc = [
    '主要擅长肺结节、肺癌',
    '主要擅长肺结节、肺癌、食管癌、胸腺瘤等疾病的多学科诊疗',
    '熟练掌握微创手术技术',
    '致力于肺癌和食管癌的精准医疗及临床转化研究'
]
flup_type_desc = [
    '自己来','我来','打电话','远程视频'
]